tap "homebrew/bundle"

# Terminal
cask "kitty"
brew "fish"
brew "fisher"
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"
brew "starship"
brew "glow"

# Editor
brew "helix"
brew "marksman"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "taplo"
brew "dockerfile-language-server"
brew "yaml-language-server"
brew "tailwindcss-language-server"
brew "rust-analyzer"
brew "llvm"

# Git
brew "gh"
brew "git"
brew "git-delta"

# Tooling
brew "jq"
brew "yq"
brew "tldr"
brew "sqlite"
brew "shellcheck"
brew "hyperfine"

# Languages
cask "dotnet-sdk"
brew "rustup"
