tap "homebrew/bundle"

# Terminal
cask "kitty"
brew "fish"
brew "fisher"
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"
brew "starship"

# Editor
brew "helix"
brew "marksman"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "taplo"

# Git
brew "gh"
brew "git"
brew "git-delta"

# Tooling
brew "jq"
brew "yq"
brew "tldr"

# Languages
cask "dotnet-sdk"

# Apps
brew "docker"
cask "postman"
cask "obsidian"
